IDEA StatiCa Open Model
Polygon3D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a polygon in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.Polygon3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Polygon3D : OpenObject
Public Class Polygon3D
	Inherits OpenObject
public ref class Polygon3D : public OpenObject
The Polygon3D type exposes the following members.
Constructors
Name | Description
Polygon3D
 Contructor
Top
Properties
Name | Description
Points
 List of polygon points
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace